# списки

# l = list()
# l = []
# l = [1, 2, 3, 4, 99]
# l2 = [4, 5, 6]
# l = [1, 2, 3, "hello", 1.12, True, int]

# l3 = l + l2 # сложение
# l3 = l2 * 5 # умножение

# print(l3)
# print(len(l3))

# --- срезы ---------------------------------------------
# print(l)
# print(l[3])
# print(l[2:5])
# print(l[::2])
# print(l[::-1])
# print(l[-1])
# l[1] = 88

# --- map join ---------------------------------------------
# l = list('hello python')
# s = ", ".join(l) # работает только если в списке все элементы str
# s = "---".join(l)
# s = "".join(l)

# print(l)
# print(s)

# l = ['1', '22', '333']
# print(list(map(len, l)))



# --- поиск элементов ---------------------------------------------
# l = [1, 2, 3, 4, 5, 'qwerty']
# print(1 in l)
# print('q' in l)
# print('q' not in l)


# --- вложенность ------------------------------------------
# l = [1, 2, 3, [1, [1, 2, [4, 6, ['hello', 'python'], 99, 103], 3], 2, 3], 5, 8]

# print(l[3][1][2][2][1])
# # print(l[3][1][2][2][2])

# --- структура данных и печать ------------------------------------------
# user = ['login6', 'password', 'name4', ['phone1', 'phone2']]


# users = [
#     ['login1', 'password', 'name1', ['phone1', 'phone2'], 12],
#     ['login2', 'password', 'name2', ['phone1', 'phone2'], 9],
#     ['login3', 'password', 'name3', ['phone1', 'phone2'], 3],
#     # ['login4', 'password', 'name3', ['phone1', 'phone2'], 3],
#     ['login5', 'password', 'name3', ['phone1', 'phone2'], 3],
# ]

# users.append(user)

# print(users[3][0])
# print(users[3][1])

# print(*users, sep='\n')

# import pprint
# from pprint import pprint
# pprint(users)

# --- методы списков ------------------------------------------
# a = []
# a.append("123") # добавить элемент
# a.append(123)
# a.append("")
# a.append([1, 2, 3])
# print(a)

# a.insert(0, 99) # вставить в нужное место 
# print(a)

# a.remove(123) # удалить по значению
# print(a)
# b = a.pop() # удалить последний
# b = a.pop(0) # удалить по индексу
# print(a, b)

# a = [1,2,6, 9, 0, 15]
# # a.sort() # меняет оригинал - возвращает None
# b = sorted(a) # глобальная функция не меняет оригинал
                # возвращает отсортированную копию 
# print(a, b)

# # a.clear() # очистить список
# # print(a)

# print(a.index(6)) # узнать индекс элемента

# a.reverse() # перевернуть список - меняет оригинал
# # b = a[::-1] # аналогично, но не меняет оригинал
# print(a)

# глобальный универсальный оператор del
# # del a[0]
# # del a[0:3]
# # print(a)


# b = [100, 101, 102]
# a.extend(b) # меняется оригинал
# c = a + b # оригиналы не меняются





# -----------------------------------
# поведение изменяемых типов данных
# изменяемые типы:
    # list (список)
    # dict (словарь)
    # set (множество) 


a = [1, 2, 3, [8, 9]]
b = a # a и b это одно и тоже - один и тот же объект
print(a is b) # True
print(id(a))
print(id(b))

b.append(5) # добавилось в оба списка, т.к. это одно и тоже
print(a, b) 


c = a.copy() # создаст поверхностную копию
# c = list(a) # аналогично создаст копию
# c = a[:] # аналогично создаст копию
print(a is b) # False - теперь это разные объекты


print(id(a), id(c))
c.append(6) # добавиться только в с
c[3].append(10) # добавится и "с" и в "а" т.к. как это вложенный список
                # поверхностные копии не затрагивают вложенные списки
print(a, b, c, sep='\n')

import copy
e = copy.deepcopy(a) # глубокая копия - создает новый объект 
                     # на всех уровнях вложенности
e[3].append(999)
print(e)


# ---------------------------------------
# a = [1, 2, 3]
# a[1] = 9
# # a[9] = 9 # ошибка - нельзя обращаться по значению только по индексу
# print(a)


# a = [
#      [1, 2, 3], 
#      [4, 5, 6], 
#      [7, 8, 9]
# ]